Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/european_government/euro_area/financial_supervision.html.txt.tmx
Source language: en
Languages: ga

source: The 2008 financial crisis exposed important failures in EU financial supervision
ga: Rinne géarchéim airgeadais 2008 teipeanna tábhachtacha a nochtadh ar mhaoirseacht airgeadais an AE

source: In 2011 a new European system was set up for the supervision of the financial sector
ga: In 2011, bunaíodh córas Eorpach nua chun maoirseacht a dhéanamh ar an earnáil airgeadais

source: The European System of Financial Supervision (ESFS) is made up of 3 European supervisory authorities (ESA):
ga: Tá 3 údarás maoirseachta Eorpacha (ÚME) sa Chóras Eorpach Maoirseoirí Airgeadais (CEMA):

source: • The European Banking Authority
ga: • An tÚdarás Baincéireachta Eorpach

source: • The European Securities and Markets Authority
ga: • An tÚdarás Eorpach um Urrúis agus Margaí

source: • The European Insurance and Occupational Pensions Authority
ga: • An tÚdarás Eorpach um Árachas agus Pinsin Cheirde

source: In cooperation and coordination with national supervisory authorities, the ESAs are in place to ensure that rules are applied in a rigorous and consistent fashion throughout the EU, to monitor developments within the financial system and to detect potential risks to financial stability
ga: I gcomhoibriú agus i gcomhordú le húdaráis náisiúnta mhaoirseachta, tá na ÚMEanna i bhfeidhm lena chinntiú go gcuirtear rialacha i bhfeidhm ar bhealach dian agus comhsheasmhach ar fud an AE, chun monatóireacht a dhéanamh ar fhorbairtí laistigh den chóras airgeadais agus chun rioscaí féideartha a shainaithint i leith cobhsaíocht airgeadais

source: The ESFS also comprises the European Systemic Risk Board as well as the Joint Committee of the European Supervisory Authorities and the national supervisory authorities
ga: Tá an Bord Eorpach um Riosca Sistéamach sa CEMA mar aon le Comhchoiste na nÚdarás Eorpach Maoirseachta agus na húdaráis náisiúnta mhaoirseachta sa CEMA chomh maith

source: The role of the European Banking Authority (EBA) is to ensure effective and consistent prudential regulation and supervision across the European banking sector
ga: Is é ról an Údaráis Bhaincéireachta Eorpaí (ÚBE) rialáil stuamachta agus maoirseacht éifeachtach agus chomhsheasmhach a chinntiú ar fud earnáil bhaincéireachta na hEorpa

source: Its overall objective is to safeguard the integrity, efficiency and orderly functioning of the banking sector
ga: Is é a gcuspóir foriomlán chun iomláine, éifeachtúlacht agus feidhmiú ordúil na hearnála baincéireachta a chosaint

source: The EBA contributes to the Single Rulebook in banking whose objective is to provide a single set of harmonised prudential rules for financial institutions throughout the EU
ga: Cuireann an ÚBE leis an Leabhar Rialacha Aonair i mbaincéireacht, a bhfuil de chuspóir aige sraith shingil rialacha stuamachta comhchuibhithe a sholáthar d’institiúidí airgeadais ar fud an AE

source: The Authority also plays a role in promoting convergence of supervisory practices and assesses risks and vulnerabilities in the EU banking sector
ga: Anuas air sin, comhlíonann an tÚdarás ról chun coinbhéirseacht cleachtas maoirseachta a chur chun cinn agus chun measúnú a dhéanamh ar rioscaí agus ar leochaileacht in earnáil bhaincéireachta an AE

source: European Securities and Markets Authority
ga: An tÚdarás Eorpach um Urrúis agus Margaí

source: The European Securities and Markets Authority (ESMA) is responsible for the integrity, transparency, efficiency and orderly functioning of securities markets, as well as for improving investor protection
ga: Tá an tÚdarás Eorpach um Urrúis agus Margaí (ÚEUM) freagrach as iomláine, trédhearcacht, éifeachtúlacht agus feidhmiú ordúil na margaí urrúis, mar aon le feabhas a chur ar chosaint infheisteoirí

source: It contributes to the Single Rrulebook for EU financial markets and encourages supervisory convergence amongst securities regulators and across financial sectors by working closely with the other European supervisory authorities
ga: Cuireann siad leis an Leabhar Rialacha Aonair do mhargaí airgeadais an AE agus spreagann siad coinbhéirseacht mhaoirseachta i measc rialtóirí urrúis agus i measc earnálacha airgeadais trí oibriú go dlúth leis na húdaráis mhaoirseachta Eorpacha eile

source: European Insurance and Occupational Pensions Authority
ga: An tÚdarás Eorpach um Árachas agus Pinsin Cheirde

source: The European Insurance and Occupational Pensions Authority (EIOPA) is responsible for supporting the transparency of markets and financial products and for fostering the protection of policyholders, pension scheme members and beneficiaries in the area of insurance and occupational pensions
ga: Tá an tÚdarás Eorpach um Árachas agus Pinsin Cheirde (ÚEÁPC) freagrach as tacú le trédhearcacht na margaí agus na dtáirgí airgeadais agus as cosaint sealbhóirí polasaí, comhaltaí scéim pinsin agus tairbhithe i limistéar an árachais agus pinsin cheirde a chothú

source: It monitors and identifies trends, potential risks and vulnerabilities across borders and across sectors
ga: Déanann siad monatóireacht ar threochtaí, rioscaí féideartha agus ar leochaileacht trasna teorainneacha agus i measc earnálacha agus iad a shainaithint

source: It also contributes to the Single Rulebook for insurance and pensions, and towards the convergence of supervisory procedures and approaches throughout the EU
ga: Anuas air sin, cuireann siad leis an Leabhar Rialacha Aonair i dtaobh árachais agus pinsean, agus i dtreo coinbhéirseacht na nósanna imeachta maoirseachta agus na gcur chuige ar fud an AE

source: European Systemic Risk Board
ga: An Bord Eorpach um Riosca Sistéamach

source: The European Systemic Risk Board (ESRB) is responsible for the macro-prudential oversight of the financial system in the EU
ga: Tá an Bord Eorpach um Riosca Sistéamach (BERS) freagrach as maoirseacht macrastuamachta a dhéanamh ar an gcóras airgeadais san AE

source: One of its main objectives is to prevent and mitigate systemic risks
ga: Ar cheann dá bpríomhchuspóirí, is ea rioscaí sistéamacha a chosc agus a mhaolú

source: If it identifies such risks it can issue warnings and recommend measures to be taken
ga: Déanann siad na rioscaí siúd a shainaithint ar féidir leo rabhaidh a eisiúint agus a mholadh cén bearta atá le glacadh ina dtaobh

source: Joint Committee of the European Supervisory Authorities
ga: Comhchoiste na nÚdarás Eorpach Maoirseachta

source: The Joint Committee of the European Supervisory Authorities is a forum for cooperation between the 3 European supervisory authorities
ga: Fóram atá i gComhchoiste na nÚdarás Eorpach Maoirseachta le haghaidh comhoibriú idir na 3 údarás maoirseachta Eorpacha

source: Through the Joint Committee, they cooperate regularly and closely and ensure consistency in their practices
ga: Tríd an gComhchoiste, comhoibríonn siad go rialta agus go dlúth agus cinntíonn siad comhsheasmhacht ina gcleachtais

source: In addition to being a forum for cooperation, the Joint Committee also plays an important role in the exchange of information with the European Systemic Risk Board (ESRB) and in developing the relationship between the ESRB and the European supervisory authorities
ga: Anuas ar bheith mar fhóram le haghaidh comhoibriú, comhlíonann an Comhchoiste ról tábhachtach i malartú faisnéise leis an mBord Eorpach um Riosca Sistéamach (BERS) agus chun an caidreamh idir an BERS agus na húdaráis mhaoirseachta Eorpacha a fhorbairt

source: Further information is available on the European Commission’s website
ga: Tá fáil ar thuilleadh faisnéise ar láithreán gréasáin an Choimisiúin Eorpaigh
